citrus-simulator-schibsted/src/main/resources/sample/pub_math_soap_service/math_multi_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <Multiply xmlns="http://tempuri.org/">
      <intA>100</intA>
      <intB>200</intB>
    </Multiply>
  </soap12:Body>
</soap12:Envelope>
