data/payloads/soap_multiply.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tns="http://tempuri.org/">
  <soap:Header/>
  <soap:Body>
    <tns:Multiply>
      <tns:intA>6</tns:intA>
      <tns:intB>7</tns:intB>
    </tns:Multiply>
  </soap:Body>
</soap:Envelope>
