weatherexercise/target/classes/examples/add.xml

<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <intA>[int]</intA>
            <intB>[int]</intB>
        </Add>
    </Body>
</Envelope>