soapproject/src/resources/requests/Subtract.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Subtract>
         <tem:intA>4</tem:intA>
         <tem:intB>2</tem:intB>
      </tem:Subtract>
   </soapenv:Body>
</soapenv:Envelope>